Revit 2027 API
MEPSection.GetCoefficient Method
 Gets the loss coefficient for the specified element id in this section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetCoefficient(
	ElementId elemId
)
Public Function GetCoefficient (
	elemId As ElementId
) As Double
public:
double GetCoefficient(
	ElementId^ elemId
)
member GetCoefficient :
        elemId : ElementId -> float
Parameters
elemId ElementId
 The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  The ElementId elemId does not correspond to a valid section member.
ArgumentNullException |  A non-optional argument was null
Remarks
 For Duct, it is loss coefficient. For Pipe, the loss coefficient is equivalent to the friction factor. Loss coefficient is a number. The unit type is UT_Number.
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace